import React from 'react';
import { NavLink } from 'react-router-dom';
import './footer.scss'
function Footer() {
    function scrollToTop(){
        window.scrollTo({
            top: 0,
            left: 0,
            behavior: 'smooth',
        });
    }
    return (
        <footer className="footer">


            <div className="footer__inner">
                <div className='footer__logo'>
                <NavLink to="/" ><img className='footer__logo-img' src={process.env.PUBLIC_URL + '/' + "images/Logo.png"} alt="logo" /></NavLink>
                </div>
                <nav className="footer__nav-wrapper">
                    <div className="footer__container">
                        <h6 className="footer__title">Компания gid</h6>
                        <ul className="footer__list">
                            <li className="footer__item">О нас</li>
                            <li className="footer__item">Наша команда</li>
                            <li className="footer__item">История</li>
                        </ul>
                    </div>
                    <div className="footer__container">
                        <h6 className="footer__title">Проекты</h6>
                        <ul className="footer__list">
                            <li className="footer__item">Квартиры</li>
                            <li className="footer__item">Коттеджы</li>
                            <li className="footer__item">Офисы</li>
                            <li className="footer__item">Рестораны</li>
                        </ul>
                    </div>
                    <div className="footer__container">
                        <h6 className="footer__title">Услуги</h6>
                        <ul className="footer__list">
                            <li className="footer__item">Квартиры</li>
                            <li className="footer__item">Коттеджы</li>
                            <li className="footer__item">Офисы</li>
                            <li className="footer__item">Рестораны</li>
                        </ul>
                    </div>
                    <div className="footer__container footer__container1">
                        <h6 className="footer__title">Контакты</h6>
                        <ul className="footer__list">
                            <li className="footer__item">+(7495) 555-15-05</li>
                            <li className="footer__item">info@gid.pro</li>
                        </ul>
                    </div>
                </nav>


                <div className="container-social">
                    <svg width="42" height="42" viewBox="0 0 42 42" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M27.447 0H14.553C2.793 0 0 2.793 0 14.553V27.447C0 39.207 2.793 42 14.553 42H27.447C39.207 42 42 39.207 42 27.447V14.553C42 2.793 39.207 0 27.447 0ZM33.915 29.967H30.849C29.694 29.967 29.337 29.022 27.3 26.943C25.452 25.2 24.654 24.948 24.213 24.948C23.604 24.948 23.415 25.116 23.415 25.998V28.749C23.415 29.484 23.184 29.946 21.231 29.946C17.997 29.946 14.406 27.972 11.886 24.339C8.085 19.005 7.056 14.973 7.056 14.175C7.056 13.734 7.203 13.314 8.085 13.314H11.172C11.949 13.314 12.243 13.65 12.537 14.49C14.049 18.9 16.569 22.68 17.598 22.68C17.997 22.68 18.165 22.491 18.165 21.525V17.01C18.06 14.952 16.947 14.763 16.947 14.028C16.947 13.65 17.241 13.314 17.724 13.314H22.533C23.184 13.314 23.415 13.65 23.415 14.448V20.517C23.415 21.168 23.688 21.399 23.898 21.399C24.276 21.399 24.612 21.168 25.305 20.454C27.51 17.997 29.085 14.196 29.085 14.196C29.295 13.755 29.631 13.335 30.45 13.335H33.453C34.377 13.335 34.587 13.818 34.377 14.469C33.999 16.254 30.261 21.525 30.303 21.525C29.967 22.05 29.841 22.281 30.303 22.89C30.618 23.331 31.689 24.255 32.403 25.074C33.705 26.565 34.713 27.804 34.986 28.665C35.217 29.526 34.797 29.967 33.915 29.967V29.967Z" fill="#BDBDBD" />
                    </svg>

                    <svg width="42" height="42" viewBox="0 0 42 42" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M20.9944 13.997C17.1383 13.997 13.9915 17.1439 13.9915 21C13.9915 24.8561 17.1383 28.003 20.9944 28.003C24.8504 28.003 27.9972 24.8561 27.9972 21C27.9972 17.1439 24.8504 13.997 20.9944 13.997ZM41.9977 21C41.9977 18.1 42.0239 15.2263 41.8611 12.3316C41.6982 8.96937 40.9312 5.98536 38.4726 3.52669C36.0087 1.06278 33.03 0.301015 29.6678 0.138155C26.7679 -0.0247052 23.8943 0.00156264 20.9996 0.00156264C18.0997 0.00156264 15.2261 -0.0247052 12.3314 0.138155C8.96921 0.301015 5.98524 1.06803 3.52663 3.52669C1.06276 5.99061 0.301009 8.96937 0.138152 12.3316C-0.0247047 15.2316 0.00156261 18.1053 0.00156261 21C0.00156261 23.8947 -0.0247047 26.7737 0.138152 29.6684C0.301009 33.0306 1.06801 36.0146 3.52663 38.4733C5.9905 40.9372 8.96921 41.699 12.3314 41.8618C15.2313 42.0247 18.105 41.9984 20.9996 41.9984C23.8995 41.9984 26.7732 42.0247 29.6678 41.8618C33.03 41.699 36.014 40.932 38.4726 38.4733C40.9365 36.0094 41.6982 33.0306 41.8611 29.6684C42.0292 26.7737 41.9977 23.9 41.9977 21V21ZM20.9944 31.775C15.0317 31.775 10.2195 26.9628 10.2195 21C10.2195 15.0372 15.0317 10.225 20.9944 10.225C26.957 10.225 31.7692 15.0372 31.7692 21C31.7692 26.9628 26.957 31.775 20.9944 31.775ZM32.2105 12.3001C30.8183 12.3001 29.6941 11.1759 29.6941 9.78367C29.6941 8.39148 30.8183 7.26722 32.2105 7.26722C33.6026 7.26722 34.7269 8.39148 34.7269 9.78367C34.7273 10.1143 34.6625 10.4417 34.5362 10.7472C34.4099 11.0527 34.2245 11.3302 33.9908 11.564C33.757 11.7978 33.4794 11.9831 33.174 12.1094C32.8685 12.2357 32.5411 12.3005 32.2105 12.3001V12.3001Z" fill="#BDBDBD" />
                    </svg>

                    <svg width="41" height="41" viewBox="0 0 41 41" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M7.48635 0C3.33924 0 0 3.33924 0 7.48634V33.5136C0 37.6607 3.33924 41 7.48635 41H21.5929V24.9715H17.3546V19.2008H21.5929V14.2706C21.5929 10.3971 24.0972 6.84059 29.866 6.84059C32.2016 6.84059 33.9288 7.06482 33.9288 7.06482L33.793 12.4538C33.793 12.4538 32.0315 12.4371 30.1094 12.4371C28.0291 12.4371 27.6955 13.3956 27.6955 14.9868V19.2008H33.9583L33.6854 24.9716H27.6955V41H33.5136C37.6608 41 41 37.6608 41 33.5137V7.48638C41 3.33928 37.6608 4.09999e-05 33.5136 4.09999e-05H7.48631L7.48635 0Z" fill="#BDBDBD" />
                    </svg>

                </div>
                <div className="to-top__wrap">
                    <button onClick={()=>scrollToTop()} className='to-top'>
                        <span>Наверх</span>
                        <svg className='to-top-svg' width="16" height="42" viewBox="0 0 16 42" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M8.70711 0.292892C8.31658 -0.0976295 7.68342 -0.0976296 7.2929 0.292892L0.928934 6.65685C0.538409 7.04738 0.538409 7.68054 0.928934 8.07107C1.31946 8.46159 1.95262 8.46159 2.34315 8.07107L8 2.41422L13.6569 8.07107C14.0474 8.46159 14.6805 8.46159 15.0711 8.07107C15.4616 7.68054 15.4616 7.04738 15.0711 6.65685L8.70711 0.292892ZM9 42L9 1L7 1L7 42L9 42Z" fill="#FAFF09" />
                        </svg>
                    </button>
                </div>

            </div>


            <div className="copy">Gid.group 2021/ All rights reserved</div>
        </footer >
    );
}

export default Footer;